package gcyl.entity.common.enums;


/**
 * 返回值枚举
 * 0:查询
 * 1:新增
 * 2:修改
 * 3:删除
 * 不同mes之间code至少隔开10个位移
 * @author lican
 * @date 2018/9/11
 */
public enum ResultEnum {

    SUCCESS("0001", "处理成功", ""),
    ERROR("9999",   "系统异常", ""),

    /**          http           **/
    METHOD_ERROR("1001", "请求方式错误", ""),
    DATA_ERROR("1002",   "请求数据格式错误", ""),

    /**          业务           **/
    BUSY("8888", "系统繁忙", ""),

    /**          店铺           **/
    S0001("S0001",   "店铺状态异常",    "店铺不存在"),

    /**          类目           **/
    C0001("C0001",   "类目信息有误",    "类目不属于店铺"),
    C0002("C0002",   "类目已存在",      "类目已存在"),

    C1001("C1001",   "添加类目失败",    "插入数据库失败"),

    C2001("C2001",   "修改类目失败",    "修改数据库失败"),

    C3001("C3001",   "删除类目失败",    "删除数据库失败"),

    /**          商品           **/
    G0002("G0002",   "获取商品失败",    "是否在售为空"),
    G0011("G0011",   "已存在相同商品",   ""),
    G0021("G0021",   "商品信息异常",    "商品不属于店铺"),

    G1001("G1001",   "添加商品失败",    "插入数据库失败"),
    G1002("G1002",   "添加商品失败",    "插入规格失败"),

    G2001("G2001",   "修改商品失败",    "修改数据库失败"),
    G2002("G2002",   "修改商品失败",    "插入规格失败"),
    G2003("G2003",   "修改商品失败",    "修改规格失败"),
    G2011("G2011",   "下架商品失败",    "修改数据库失败"),
    G2021("G2021",   "上架商品失败",    "修改数据库失败"),
    G2031("G2031",   "恢复库存失败",    "修改数据库失败"),
    G2041("G2041",   "商品信息异常",    "修改库存失败"),
    G2042("G2042",   "商品库存不足",    ""),
    G2043("G2043",   "商品信息异常",    "商品库存不存在"),
    G2053("G2053",   "增加商品销量失败", "修改数据库失败"),

    G3001("G3001",   "删除商品失败",    "修改数据库失败"),

    /**          购物车           **/
    CT0001("CT0001", "订单变化,请刷新",  "购物车商品发生变化"),

    CT1001("CT1001", "添加商品失败",   "商品规格删除、下架、不存在"),
    CT1002("CT1002", "商品库存不足",     ""),
    CT1003("CT1003", "默认商品无须添加",""),


    /**          订单           **/
    O0001("O0001",   "订单信息异常",    "订单不属于店铺"),
    O0002("O0002",   "订单信息异常",    "订单不属于用户"),
    O0003("O0003",   "订单异常",       "查询不到店铺订单"),
    O0004("O0004",   "订单异常",       "查询不到用户订单"),

    O1001("O1001",   "下单失败",       "插入数据库失败"),
    O1002("O1002",   "下单失败",       "插入规格失败"),
    O1003("O1003",   "下单失败",       "清空购物车失败"),
    O1004("O1004",   "下单失败",       "价格计算有误"),
    O1011("O1011",   "修改订单支付失败", "修改数据库失败"),

    O2002("O2002",   "修改订单失败",    "修改订单状态失败"),
    O2010("O2010",   "订单状态异常",    "订单ID或状态为空"),
    O2011("O2011",   "订单状态异常",    "无目标订单状态"),
    O2012("O2012",   "订单状态异常",    "不是待接单"),
    O2013("O2013",   "订单状态异常",    "不是待上菜"),
    O2014("O2014",   "订单状态异常",    "不是待上菜或上菜完成"),
    O2015("O2015",   "订单状态异常",    "不是待上菜或上菜完成"),
    O2021("O2021",   "确认收款失败",    "修改数据库失败");

    /**
     * 编码
     */
    String code;

    /**
     * 返回信息
     */
    String mes;

    /**
     * 详细信息
     */
    String detail;

    ResultEnum(String code, String mes, String detail) {
        this.code = code;
        this.mes = mes;
        this.detail = detail;
    }

    public String getCode() {
        return code;
    }

    public String getMes() {
        return mes;
    }

    public String getDetail() {
        return detail;
    }

    @Override
    public String toString() {
        return this.getMes() + ":" + this.getCode() + ":" + this.getDetail();
    }
}
